YesIcan-1/esp8266-ai/firmware/src/main.cpp
// ---------- stock watchlist screen ----------

bool handleStockPayload(const String &payload) {
  JsonDocument doc;
  if (deserializeJson(doc, payload)) return false;
  JsonArray arr = doc["stocks"];
  stockCount = 0;
  for (JsonObject s : arr) {
    if (stockCount >= MAX_STOCKS) break;
    stocks[stockCount].code = s["code"] | "";
    stocks[stockCount].price = s["price"] | "";
    stocks[stockCount].pct = s["pct"] | "";
    stocks[stockCount].up = s["up"] | 0;
    stockCount++;
  }
  stockNamesRev = doc["names_rev"] | -1;
  stockEverLoaded = true;
  stockDirty = true;
  return true;
}

// Streams the Mac-rendered name strips and blits one per row (top line,
// right of the ASCII code). Wired-only mode has no HTTP: codes still show.
bool drawStockNames() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/stock/names.raw";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return false;
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    http.end();
    return false;
  }
  WiFiClient *stream = http.getStreamPtr();
  uint8_t cnt = 0;
  if (stream->readBytes(&cnt, 1) != 1) {
    http.end();
    return false;
  }
  const size_t rowBytes = (size_t)STOCK_NAME_W * 2;
  bool ok = true;
  for (int i = 0; i < cnt && ok; i++) {
    int y0 = 10 + i * 54;
    for (int r = 0; r < STOCK_NAME_H; r++) {
      if (stream->readBytes((uint8_t *)rowBuf, rowBytes) != (int)rowBytes) {
        ok = false;
        break;
      }
      if (i < stockCount) tft.pushImage(70, y0 + r, STOCK_NAME_W, 1, rowBuf);
      yield();
    }
  }
  http.end();
  return ok;
}

void pollStock() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/stock";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) handleStockPayload(http.getString());
  http.end();
}

// 54px per row: small grey code on top, big font-4 price (white) on the left
// and change% on the right - red rising / green falling (CN convention).
// Rows repaint only when their text changes, same trick as everywhere else.
void drawStockScreen() {
  if (!stockChromeDrawn) {
    tft.fillScreen(TFT_BLACK);
    stockChromeDrawn = true;
    for (int i = 0; i < MAX_STOCKS; i++) {
      stockLastCode[i] = "\x01"; // force repaint
      stockLastVal[i] = "\x01";
    }
    stockNamesDrawnRev = -1;
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(0x7BEF, TFT_BLACK);
    tft.drawString("STOCKS", SCREEN_CX, 228, 1);
  }
  stockDirty = false;

  if (stockCount == 0) {
    if (stockLastCode[0] != "") {
      for (int i = 0; i < MAX_STOCKS; i++) {
        stockLastCode[i] = "";
        stockLastVal[i] = "";
      }
      tft.fillRect(0, 0, SCREEN_W, 226, TFT_BLACK);
      tft.setTextDatum(TC_DATUM);
      tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      tft.drawString(stockEverLoaded ? "No stocks configured" : "Waiting for bridge...", SCREEN_CX, 100, 2);
      if (stockEverLoaded) tft.drawString("Mac menu: Set watchlist", SCREEN_CX, 124, 2);
    }
    return;
  }

  for (int i = 0; i < MAX_STOCKS; i++) {
    int y0 = 10 + i * 54;
    bool has = i < stockCount;
    // top line (code + name strip) and value line refresh independently, so
    // a price tick never wipes the name bitmap
    String codeKey = has ? stocks[i].code : "";
    if (codeKey != stockLastCode[i]) {
      stockLastCode[i] = codeKey;
      tft.fillRect(0, y0, SCREEN_W, 17, TFT_BLACK);
      stockNamesDrawnRev = -1; // strip area wiped: re-fetch names
      if (has) {
        tft.setTextDatum(TL_DATUM);
        tft.setTextColor(0x7BEF, TFT_BLACK);
        tft.drawString(stocks[i].code, 14, y0, 2);
      }
    }
    String valKey = has ? stocks[i].price + "|" + stocks[i].pct + "|" + String(stocks[i].up) : "";
    if (valKey != stockLastVal[i]) {
      stockLastVal[i] = valKey;
      tft.fillRect(0, y0 + 18, SCREEN_W, 36, TFT_BLACK); // value line + inter-row gap
      if (has) {
        tft.setTextDatum(TL_DATUM);
        tft.setTextColor(TFT_WHITE, TFT_BLACK);
        tft.drawString(stocks[i].price, 14, y0 + 18, 4);
        uint16_t pc = stocks[i].up > 0 ? TFT_RED : (stocks[i].up < 0 ? TFT_GREEN : TFT_LIGHTGREY);
        tft.setTextDatum(TR_DATUM);
        tft.setTextColor(pc, TFT_BLACK);
        tft.drawString(stocks[i].pct, 226, y0 + 18, 4);
      }
    }
  }

  // CJK name strips, re-fetched when the watchlist (names_rev) changes
  if (stockNamesRev >= 0 && stockNamesDrawnRev != stockNamesRev) {
    if (drawStockNames()) stockNamesDrawnRev = stockNamesRev;
  }
}

// ---------- clock mode (SNTP wall clock; works without the bridge) ----------
// Time comes from the ESP8266 core's built-in SNTP (configTime) once WiFi is
// up; in wired-only mode (no WiFi -> no SNTP) the bridge pushes an "epoch"
// field inside /status (and #STATUS) that we settimeofday() from instead.
// The clock page deliberately never red-flashes on bridge loss: a stale
// bridge is not an alert condition for a wall clock.
const unsigned long CLOCK_TICK_MS = 500; // 2Hz tick -> 1Hz colon blink
bool ntpConfigured = false;
bool clockChromeDrawn = false;
String clockLastTime, clockLastDate;
unsigned long lastClockTickMs = 0;
bool clockColonOn = true;

void setupNtp() {
  if (ntpConfigured) return;
  configTime(CLOCK_TZ, CLOCK_NTP_SERVER1, CLOCK_NTP_SERVER2);
  ntpConfigured = true;
  Serial.println("[clock] SNTP configured, tz=" CLOCK_TZ);
}

// Bridge-supplied epoch. Accept only sane values so a garbage payload can't
// scramble the display.
void setClockFromEpoch(long epoch) {
  if (epoch < 1700000000L) return; // before 2023-11: clearly bogus
  timeval tv;
  tv.tv_sec = epoch;
  tv.tv_usec = 0;
  settimeofday(&tv, nullptr);
}

bool clockTimeValid() { return time(nullptr) > 1700000000L; }

// ASCII-only: the panel fonts have no CJK glyphs. FONT7 is a 48px 7-segment
// face containing digits, '-' and ':' - perfect for HH:MM. The colon blinks
// at 1Hz as the seconds indicator. Repaints are change-detected, so a steady
// minute only draws once; the blink only repaints 5 glyphs.
const char *WEEKDAY_EN[] = {"SUN", "MON", "TUE", "WED", "THU", "FRI", "SAT"};

// ---------- weather (clock page companion) ----------
// Data comes from the bridge (GET /weather + /weather/name.raw); the bridge
// fetches Open-Meteo every 10 minutes. The clock page polls it every 60s
// while visible and degrades to "--" when the bridge has no weather (old
// bridge, offline, wired-only mode). The CJK city/condition text arrives as a
// bridge-rendered RGB565 strip, same trick as stock names / music titles.
const unsigned long WEATHER_POLL_INTERVAL_MS = 60000;

// Clock page v3, modeled on the reference product face (black, no hairlines):
// top-left city/condition strip + "最高33° 最低26°" strip, colored icon
// top-right; center: big white HH + blinking colon + orange MM + small
// seconds; "7月25日 周一" date strip; then data rows (glyph + rounded bar +
// value): temperature, humidity, agent 5H, agent WK; DeepSeek line at bottom.
const int WEATHER_NAME_W = 108, WEATHER_NAME_H = 16;
const int WEATHER_HILO_W = 108, WEATHER_HILO_H = 16;
const int DATE_STRIP_W = 120, DATE_STRIP_H = 16;
const int CITY_STRIP_X = 16, CITY_STRIP_Y = 8;
const int HILO_STRIP_X = 16, HILO_STRIP_Y = 28;
const int WEATHER_ICON_X = 196, WEATHER_ICON_Y = 6;
const int CLOCK_TIME_Y = 52;
const int DATE_STRIP_X = 16, DATE_STRIP_Y = 108;
const int ROW_LABEL_X = 10;
const int ROW_BAR_X = 34, ROW_BAR_W = 58, ROW_BAR_H = 9;
const int ROW_VAL_X = 96; // LEFT edge of every value (temp, humidity, DS balance)

// Corner pet on the clock page: the current app's sprite (custom upload or
// built-in) downscaled into the bottom-right box, floating over the
// wallpaper (pure-black pixels transparent). Left column keeps the data rows.
const int PET_BOX = 80;
const int PET_X = 240 - PET_BOX - 4;  // 156
const int PET_Y = 240 - PET_BOX;      // 160, flush with the bottom edge
int clockPetFrame = 0;
unsigned long lastClockPetMs = 0;


// ---------- desktop wallpaper background (clock page) ----------
// The bridge composites the Mac's current desktop wallpaper (aspect-fill,
// darkened for legibility) plus the CJK text lines into one
// 240x240 RGB565 bitmap, served as /clockbg.raw with bg_rev inside /weather
// (or pushed over serial as #BG frames when the wired link owns the path).
// Downloaded to LittleFS once per rev; every repaint then blits regions from
// that file instead of filling black. Off or unavailable -> plain black.
const char *CLOCKBG_FILE = "/bg.bin";
const char *WALLPAPER_CFG = "/wallpaper.cfg";
const size_t CLOCKBG_BYTES = 240 * 240 * 2;
bool wallpaperOn = true;     // user toggle (device web page)
bool wallpaperReady = false; // /bg.bin exists and is complete
int bgRev = -1;              // newest rev the bridge reported
int bgDrawnRev = -1;         // rev currently stored in /bg.bin
unsigned long lastBgTryMs = 0;
unsigned long lastBgNeedMs = 0; // wired-mode #NEED re-request pacing

void blitBg(int x, int y, int w, int h); // defined below, next to the bg file
bool wiredActive();       // defined below with the wired serial link section
extern int fileRxType;    // serial bulk file transfer in progress (0=none)

void loadWallpaperCfg() {
  wallpaperReady = false;
  if (LittleFS.exists(WALLPAPER_CFG)) {
    File f = LittleFS.open(WALLPAPER_CFG, "r");
    if (f) {
      wallpaperOn = f.readStringUntil('\n').toInt() != 0;
      bgDrawnRev = f.readStringUntil('\n').toInt();
      f.close();
    }
  }
  if (LittleFS.exists(CLOCKBG_FILE)) {
    File f = LittleFS.open(CLOCKBG_FILE, "r");
    if (f) {
      wallpaperReady = (size_t)f.size() == CLOCKBG_BYTES;
      f.close();
    }
  }
  if (!wallpaperReady) bgDrawnRev = -1; // refetch after any truncation
  Serial.printf("[wallpaper] on=%d ready=%d rev=%d\n", wallpaperOn, wallpaperReady, bgDrawnRev);
}

