YesIcan-1/esp8266-ai/firmware/src/main.cpp
void saveWallpaperCfg() {
  File f = LittleFS.open(WALLPAPER_CFG, "w");
  if (!f) return;
  f.println(wallpaperOn ? 1 : 0);
  f.println(bgDrawnRev);
  f.close();
}

// Downloads the composited background into LittleFS: 115200 bytes, one
// screen row at a time (rowBuf is exactly 240*2 bytes).
bool downloadWallpaper() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/clockbg.raw";
  http.setTimeout(20000); // far longer than the 2s poll timeout: 115KB body
  if (!http.begin(client, url)) return false;
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    http.end();
    return false;
  }
  File f = LittleFS.open(CLOCKBG_FILE, "w");
  if (!f) {
    http.end();
    return false;
  }
  WiFiClient *stream = http.getStreamPtr();
  size_t total = 0;
  bool ok = true;
  while (total < CLOCKBG_BYTES) {
    size_t want = min((size_t)(240 * 2), CLOCKBG_BYTES - total);
    if (stream->readBytes((uint8_t *)rowBuf, want) != (int)want) {
      ok = false;
      break;
    }
    f.write((uint8_t *)rowBuf, want);
    total += want;
    yield();
  }
  f.close();
  http.end();
  if (!ok) LittleFS.remove(CLOCKBG_FILE);
  Serial.printf("[wallpaper] download %s (%u bytes)\n", ok ? "ok" : "FAILED", (unsigned)total);
  return ok;
}

// Fills a region from the composited background, or plain black when the
// wallpaper is off/unavailable. Drop-in replacement for fillRect(TFT_BLACK).
void blitBg(int x, int y, int w, int h) {
  if (wallpaperOn && wallpaperReady) {
    File f = LittleFS.open(CLOCKBG_FILE, "r");
    if (f) {
      bool ok = true;
      for (int r = 0; r < h; r++) {
        f.seek(((size_t)(y + r) * 240 + x) * 2);
        if (f.read((uint8_t *)rowBuf, (size_t)w * 2) != (int)((size_t)w * 2)) {
          ok = false;
          break;
        }
        tft.pushImage(x, y + r, w, 1, rowBuf);
        if ((r & 31) == 31) yield();
      }
      f.close();
      if (ok) return;
    }
  }
  tft.fillRect(x, y, w, h, TFT_BLACK);
}

// Draws one frame of the current app's pet animation scaled (nearest, any
// ratio) into the bottom-right corner box. Each screen row is COMPOSITED in
// RAM first — background row from the wallpaper, then the sprite's non-black
// pixels laid over it — and pushed exactly once. No bg-then-sprite two-pass,
// so the pet never flickers even at the 120ms walk-cycle cadence.
void drawClockPet(int app, int frameIdx) {
  bool custom = (app == APP_CLAUDE) ? claudeCustom : codexCustom;
  const char *file = (app == APP_CLAUDE) ? CLAUDE_SPRITE_FILE : CODEX_SPRITE_FILE;
  const uint16_t *const *frames = (app == APP_CLAUDE) ? claude_sprite_frames : codex_sprite_frames;
  int w = (app == APP_CLAUDE) ? CLAUDE_SPRITE_W : CODEX_SPRITE_W;
  int h = (app == APP_CLAUDE) ? CLAUDE_SPRITE_H : CODEX_SPRITE_H;
  size_t frameBytes = (app == APP_CLAUDE) ? CLAUDE_FRAME_BYTES : CODEX_FRAME_BYTES;
  int big = max(w, h);
  int outW = (int)(((long)w * PET_BOX) / big), outH = (int)(((long)h * PET_BOX) / big);
  int xRel = (PET_BOX - outW) / 2, yRel = (PET_BOX - outH) / 2;
  bool bgActive = wallpaperOn && wallpaperReady;

  File bgf, f;
  bool bgOk = false;
  if (bgActive) {
    bgf = LittleFS.open(CLOCKBG_FILE, "r");
    bgOk = (bool)bgf;
  }
  if (custom) {
    f = LittleFS.open(file, "r");
    if (!f) {
      if (bgf) bgf.close();
      return;
    }
  }
  for (int r = 0; r < PET_BOX; r++) {
    // 1) background row (or plain black when the wallpaper is off)
    if (bgOk) {
      bgf.seek(((size_t)(PET_Y + r) * 240 + PET_X) * 2);
      if (bgf.read((uint8_t *)rowBuf, PET_BOX * 2) != PET_BOX * 2) bgOk = false;
    }
    if (!bgOk) memset(rowBuf, 0, PET_BOX * 2);
    // 2) overlay the sprite row's non-black pixels
    int ry = r - yRel;
    if (ry >= 0 && ry < outH) {
      int sr = (int)(((long)ry * h) / outH); // nearest source row
      bool got;
      if (custom) {
        f.seek(1 + (size_t)frameIdx * frameBytes + (size_t)sr * w * 2);
        got = f.read((uint8_t *)prevRowBuf, (size_t)w * 2) == (int)((size_t)w * 2);
      } else {
        memcpy_P(prevRowBuf, frames[frameIdx] + (size_t)sr * w, (size_t)w * 2);
        got = true;
      }
      if (got) {
        for (int c = 0; c < outW; c++) {
          uint16_t v = prevRowBuf[(int)(((long)c * w) / outW)];
          if (v != 0x0000) rowBuf[xRel + c] = v; // black = transparent
        }
      }
    }
    tft.pushImage(PET_X, PET_Y + r, PET_BOX, 1, rowBuf);
  }
  if (bgf) bgf.close();
  if (custom) f.close();
}
const int ROW_TEMP_Y = 148, ROW_HUM_Y = 172;
const int DS_Y = 204; // single-line DeepSeek row: dot + DPS CNY + balance

bool weatherEverLoaded = false;
int weatherCode = -1; // WMO weather code from the bridge; -1 = no data
float weatherTempC = 0;
float weatherTMax = 0, weatherTMin = 0;
int weatherHumidity = -1;
int weatherNameRev = -1, weatherNameDrawnRev = -1;
int weatherHiloRev = -1, weatherHiloDrawnRev = -1;
int dateDrawnRev = -1; // local-date rev of the drawn date strip
unsigned long lastWeatherPollMs = 0;
// strip fetch retry pacing: an unreachable bridge must not stall the 2Hz tick
unsigned long lastNameTryMs = 0, lastHiloTryMs = 0, lastDateTryMs = 0;

// ---------- DeepSeek balance (clock page companion) ----------
// DeepSeek is pay-as-you-go, so the bridge reports the remaining account
// balance (GET /deepseek, or a serial #DEEPSEEK frame when wired). Refreshed
// every 5 minutes bridge-side; shown as one small line on the clock page.
bool dsEverLoaded = false;
bool dsAvailable = false;
float dsBalance = 0;
char dsCurrency[4] = "CNY";

// Shared parser for the /deepseek JSON, reached via HTTP poll or serial.
bool handleDeepSeekPayload(const String &json) {
  JsonDocument doc;
  if (deserializeJson(doc, json)) return false;
  dsEverLoaded = doc["ok"] | false;
  dsAvailable = doc["avail"] | false;
  dsBalance = doc["bal"] | 0.0f;
  strlcpy(dsCurrency, doc["cur"] | "CNY", sizeof(dsCurrency));
  return true;
}

void pollDeepSeek() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/deepseek";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) handleDeepSeekPayload(http.getString());
  http.end();
}

int weatherIconIndex(int code) {
  if (code < 0) return 7;                          // unknown
  if (code <= 1) return 0;                         // clear / mainly clear
  if (code == 2) return 1;                         // partly cloudy
  if (code == 3) return 2;                         // overcast
  if (code == 45 || code == 48) return 3;          // fog
  if ((code >= 51 && code <= 67) || (code >= 80 && code <= 82)) return 4; // rain
  if ((code >= 71 && code <= 77) || code == 85 || code == 86) return 5;   // snow
  if (code >= 95) return 6;                        // thunderstorm
  return 7;
}

