YesIcan-1/esp8266-ai/firmware/src/main.cpp
void drawWeatherIcon(int idx) {
  const uint16_t *icon = weather_icons[idx];
  bool transparent = wallpaperOn && wallpaperReady; // black pixels float over wallpaper
  for (int r = 0; r < WEATHER_ICON_H; r++) {
    memcpy_P(rowBuf, icon + (size_t)r * WEATHER_ICON_W, WEATHER_ICON_W * 2);
    if (transparent) tft.pushImage(WEATHER_ICON_X, WEATHER_ICON_Y + r, WEATHER_ICON_W, 1, rowBuf, TFT_BLACK);
    else tft.pushImage(WEATHER_ICON_X, WEATHER_ICON_Y + r, WEATHER_ICON_W, 1, rowBuf);
  }
}

// Streams a bridge-rendered RGB565 strip (fixed size, no count byte) and
// blits it at (x, y) - used for the city, hi/lo and CJK date lines.
bool fetchStrip(const char *path, int x, int y, int w, int h) {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + path;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return false;
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    http.end();
    return false;
  }
  WiFiClient *stream = http.getStreamPtr();
  const size_t rowBytes = (size_t)w * 2;
  bool ok = true;
  for (int r = 0; r < h; r++) {
    if (stream->readBytes((uint8_t *)rowBuf, rowBytes) != (int)rowBytes) {
      ok = false;
      break;
    }
    tft.pushImage(x, y + r, w, 1, rowBuf);
    yield();
  }
  http.end();
  return ok;
}

// Shared parser for the /weather JSON, reached via HTTP poll or a serial
// "#WEATHER " frame when the wired link owns the data path.
bool handleWeatherPayload(const String &json) {
  JsonDocument doc;
  if (deserializeJson(doc, json)) return false;
  weatherEverLoaded = doc["ok"] | false;
  weatherTempC = doc["temp"] | 0.0f;
  weatherCode = doc["code"] | -1;
  weatherHumidity = doc["humidity"] | -1;
  weatherTMax = doc["tmax"] | 0.0f;
  weatherTMin = doc["tmin"] | 0.0f;
  weatherNameRev = doc["name_rev"] | -1;
  weatherHiloRev = doc["hilo_rev"] | -1;
  bgRev = doc["bg_rev"] | -1;
  return true;
}

void pollWeather() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/weather";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) handleWeatherPayload(http.getString());
  Serial.printf("[weather] GET -> %d ok=%d temp=%.1f code=%d hum=%d\n", code, weatherEverLoaded,
                weatherTempC, weatherCode, weatherHumidity);
  http.end();
}

// Usage level -> bar color: green while comfortable, amber past half,
// red past 80% (the pct is how much of the window is USED).
uint16_t quotaBarColor(float pct) {
  if (pct < 50) return TFT_GREEN;
  if (pct < 80) return TFT_YELLOW;
  return TFT_RED;
}

// Rounded data-row bar on a dark track; frac is 0..1, -1 = unknown (empty).
void drawRowBar(int y, float frac, uint16_t color) {
  tft.fillRoundRect(ROW_BAR_X, y + 3, ROW_BAR_W, ROW_BAR_H, 4, 0x2104);
  if (frac < 0) return;
  if (frac > 1) frac = 1;
  int fw = (int)lroundf(ROW_BAR_W * frac);
  if (fw >= 8) tft.fillRoundRect(ROW_BAR_X, y + 3, fw, ROW_BAR_H, 4, color);
  else if (fw > 0) tft.fillRect(ROW_BAR_X, y + 3, fw, ROW_BAR_H, color);
}

// 7x9 droplet glyph (humidity row).
void drawDroplet(int x, int y, uint16_t color) {
  tft.fillTriangle(x + 3, y, x, y + 5, x + 6, y + 5, color);
  tft.fillCircle(x + 3, y + 5, 3, color);
}

// 12x13 thermometer glyph (temperature row).
void drawThermoGlyph(int x, int y, uint16_t color) {
  tft.fillRoundRect(x + 4, y, 4, 8, 2, color); // stem
  tft.fillCircle(x + 6, y + 9, 4, color);      // bulb
}

// Repaint detectors for the data-driven zones.
int clockLastTempInt = -999, clockLastHumInt = -999;

void drawClockScreen(bool force) {
  if (!clockChromeDrawn) {
    if (wallpaperOn && wallpaperReady) blitBg(0, 0, 240, 240);
    else tft.fillScreen(TFT_BLACK);
    clockChromeDrawn = true;
    weatherNameDrawnRev = -1; // strip areas were wiped: re-fetch
    weatherHiloDrawnRev = -1;
    dateDrawnRev = -1;
    clockLastTempInt = -999;
    clockLastHumInt = -999;
    force = true;
  }

  // --- background: refresh the composited wallpaper when bg_rev bumps ---
  // (the CJK city/hi-lo/date lines are baked into that image, so when the
  // wallpaper is active the per-strip fetches below are skipped)
  unsigned long nowMs = millis();
  if (wallpaperOn && bgRev >= 0 && bgRev != bgDrawnRev && nowMs - lastBgTryMs >= 30000UL &&
      !wiredActive() && !fileRxType) { // wired: the serial #BG push owns this path
    lastBgTryMs = nowMs;
    if (downloadWallpaper()) {
      bgDrawnRev = bgRev;
      wallpaperReady = true;
      saveWallpaperCfg();
      clockChromeDrawn = false; // next tick repaints over the fresh background
      return;
    }
  }
  // Wired mode and out of sync (a push failed or the bridge restarted): ask
  // the bridge for a re-push, paced to once a minute.
  if (wallpaperOn && bgRev >= 0 && bgRev != bgDrawnRev && wiredActive() && !fileRxType &&
      nowMs - lastBgNeedMs >= 60000UL) {
    lastBgNeedMs = nowMs;
    Serial.println("#NEED");
  }
  bool bgActive = wallpaperOn && wallpaperReady;

  // --- center time: white HH + blinking colon + orange MM + small seconds ---
  int tmYdayRev = -1;
  char hh[3] = "--", mm[3] = "--", ss[3] = "--";
  if (clockTimeValid()) {
    struct tm tmNow;
    time_t now = time(nullptr);
    localtime_r(&now, &tmNow);
    tmYdayRev = tmNow.tm_year * 400 + tmNow.tm_yday;
    snprintf(hh, sizeof(hh), "%02d", tmNow.tm_hour);
    snprintf(mm, sizeof(mm), "%02d", tmNow.tm_min);
    snprintf(ss, sizeof(ss), "%02d", tmNow.tm_sec);
  }
  {
    // Per-glyph repaint: only the digits that actually changed get their
    // little background patch re-blitted and redrawn. The 1Hz seconds/colon
    // touch ~30px instead of the whole row, so nothing visibly flashes.
    int wHH = tft.textWidth("22", 7);
    int wColon = tft.textWidth(":", 7);
    int wSS = tft.textWidth("22", 2);
    const int gap = 6;
    int total = wHH + wColon + wHH + gap + wSS;
    int x = (240 - total) / 2;
    int xColon = x + wHH, xMM = xColon + wColon, xSS = xMM + wHH + gap;
    static char lastHH[3] = "", lastMM[3] = "", lastSS[3] = "";
    static bool lastColon = false;
    if (force) { lastHH[0] = lastMM[0] = lastSS[0] = 0; lastColon = !clockColonOn; }
    tft.setTextDatum(TL_DATUM);
    if (strcmp(hh, lastHH) != 0) {
      strcpy(lastHH, hh);
      blitBg(x - 2, CLOCK_TIME_Y - 4, wHH + 4, 56);
      tft.setTextColor(TFT_WHITE);
      tft.drawString(hh, x, CLOCK_TIME_Y, 7);
    }
    if (clockColonOn != lastColon) {
      lastColon = clockColonOn;
      blitBg(xColon, CLOCK_TIME_Y - 4, wColon, 56);
      if (clockColonOn) {
        tft.setTextColor(TFT_WHITE);
        tft.drawString(":", xColon, CLOCK_TIME_Y, 7);
      }
    }
    if (strcmp(mm, lastMM) != 0) {
      strcpy(lastMM, mm);
      blitBg(xMM, CLOCK_TIME_Y - 4, wHH + 2, 56);
      tft.setTextColor(TFT_ORANGE);
      tft.drawString(mm, xMM, CLOCK_TIME_Y, 7);
    }
    if (strcmp(ss, lastSS) != 0) {
      strcpy(lastSS, ss);
      blitBg(xSS, CLOCK_TIME_Y + 28, wSS + 2, 24);
      tft.setTextColor(TFT_WHITE);
      tft.drawString(ss, xSS, CLOCK_TIME_Y + 32, 2);
    }
  }

  // --- top-right icon slot: custom animation wins, else the weather icon ---
  static int weatherDrawnIcon = -1;
  static bool slotWasAnim = false;
  if (force) {
    weatherDrawnIcon = -1;
    slotWasAnim = false;
  }
  {
    int wantIcon = weatherEverLoaded ? weatherIconIndex(weatherCode) : 7;
    if (wantIcon != weatherDrawnIcon || slotWasAnim) {
      slotWasAnim = false;
      weatherDrawnIcon = wantIcon;
      blitBg(WEATHER_ICON_X - 4, WEATHER_ICON_Y - 4, 40, 40); // no chip: blend into the bg
      drawWeatherIcon(wantIcon);
    }
  }

