YesIcan-1/esp8266-ai/firmware/src/main.cpp
  // --- CJK strips: only when the wallpaper background is OFF (when it's
  // on, those lines are baked into the composited background image). Wired
  // mode: strips arrive as #STRIP serial pushes instead of HTTP fetches. ---
  if (!bgActive && !wiredActive() && weatherEverLoaded && weatherNameRev >= 0 &&
      weatherNameDrawnRev != weatherNameRev && nowMs - lastNameTryMs >= 30000UL) {
    lastNameTryMs = nowMs;
    if (fetchStrip("/weather/name.raw", CITY_STRIP_X, CITY_STRIP_Y, WEATHER_NAME_W, WEATHER_NAME_H))
      weatherNameDrawnRev = weatherNameRev;
  }
  if (!bgActive && !wiredActive() && weatherEverLoaded && weatherHiloRev >= 0 &&
      weatherHiloDrawnRev != weatherHiloRev && nowMs - lastHiloTryMs >= 30000UL) {
    lastHiloTryMs = nowMs;
    if (fetchStrip("/weather/hilo.raw", HILO_STRIP_X, HILO_STRIP_Y, WEATHER_HILO_W, WEATHER_HILO_H))
      weatherHiloDrawnRev = weatherHiloRev;
  }
  if (!bgActive && !wiredActive() && tmYdayRev >= 0 && tmYdayRev != dateDrawnRev &&
      nowMs - lastDateTryMs >= 30000UL) {
    lastDateTryMs = nowMs;
    if (fetchStrip("/date.raw", DATE_STRIP_X, DATE_STRIP_Y, DATE_STRIP_W, DATE_STRIP_H))
      dateDrawnRev = tmYdayRev;
  }

  // --- temperature row: thermo glyph + bar (-10..40C) + value (values are
  // LEFT-aligned at ROW_VAL_X = 96, one shared numbers column) ---
  int tInt = weatherEverLoaded ? (int)lroundf(weatherTempC) : -999;
  if (force || tInt != clockLastTempInt) {
    clockLastTempInt = tInt;
    blitBg(0, ROW_TEMP_Y, PET_X, 20);
    drawThermoGlyph(ROW_LABEL_X, ROW_TEMP_Y + 2, TFT_RED);
    drawRowBar(ROW_TEMP_Y, tInt == -999 ? -1 : (weatherTempC + 10.0f) / 50.0f, TFT_RED);
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(TFT_WHITE);
    if (tInt == -999) {
      tft.drawString("--", ROW_VAL_X, ROW_TEMP_Y, 2);
    } else {
      String t = String(tInt);
      tft.drawString(t, ROW_VAL_X, ROW_TEMP_Y, 2);
      tft.drawCircle(ROW_VAL_X + tft.textWidth(t, 2) + 3, ROW_TEMP_Y + 3, 2, TFT_WHITE); // degree dot
    }
  }

  // --- humidity row: droplet glyph + bar (0..100%) + value ---
  int hInt = weatherEverLoaded ? weatherHumidity : -1;
  if (force || hInt != clockLastHumInt) {
    clockLastHumInt = hInt;
    blitBg(0, ROW_HUM_Y, PET_X, 20);
    drawDroplet(ROW_LABEL_X + 2, ROW_HUM_Y + 4, TFT_GREEN);
    drawRowBar(ROW_HUM_Y, hInt >= 0 ? hInt / 100.0f : -1, TFT_GREEN);
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(TFT_WHITE);
    tft.drawString(hInt >= 0 ? String(hInt) + "%" : "--", ROW_VAL_X, ROW_HUM_Y, 2);
  }

  // --- DeepSeek single line: dot in the glyph column, "DPS" (16px) + "CNY"
  // (small suffix) left-aligned to the BAR column (34), balance LEFT-aligned
  // to the shared numbers column (ROW_VAL_X = 96), same 16px font.
  String dsVal = dsEverLoaded ? String(dsBalance, 2) : "--";
  uint16_t dotColor = !dsEverLoaded ? 0x4208 : (dsAvailable ? TFT_GREEN : TFT_RED);
  static String lastDsLabel = "\x01", lastDsVal = "\x01";
  static uint16_t lastDotColor = 0xFFFF;
  String dsLabel = "DPS " + String(dsCurrency);
  if (force || dsLabel != lastDsLabel || dsVal != lastDsVal || dotColor != lastDotColor) {
    lastDsLabel = dsLabel;
    lastDsVal = dsVal;
    lastDotColor = dotColor;
    blitBg(0, DS_Y - 2, PET_X, 20);
    tft.fillCircle(14, DS_Y + 8, 4, dotColor);
    tft.setTextDatum(TL_DATUM);
    if (bgActive) tft.setTextColor(0x9DF3); else tft.setTextColor(0x9DF3, TFT_BLACK);
    tft.drawString("DPS", ROW_BAR_X, DS_Y, 2);
    tft.drawString(dsCurrency, ROW_BAR_X + tft.textWidth("DPS", 2) + 5, DS_Y + 8, 1);
    tft.setTextColor(TFT_WHITE);
    tft.drawString(dsVal, ROW_VAL_X, DS_Y, 2);
  }

  // --- corner pet: the app currently "on duty", scaled into the big
  // bottom-right box. loop() advances clockPetFrame at the pet-page cadence.
  static int petDrawnApp = -1;
  if (force || petDrawnApp != (int)currentApp) {
    petDrawnApp = (int)currentApp;
    clockPetFrame = 0;
    drawClockPet(currentApp, clockPetFrame);
  }
}

void clockTick() {
  clockColonOn = !clockColonOn; // 1Hz blink; minute rollover caught by text compare
  drawClockScreen(false);
}

// ---------- WiFi / bridge polling ----------

WiFiManager wifiManager; // global: the config portal now runs non-blocking in loop()

void configModeCallback(WiFiManager *wm) {
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("WiFi setup needed", 8, 32, 2);
  tft.drawString("Connect phone to AP:", 8, 62, 2);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.drawString(WIFI_PORTAL_AP_NAME, 8, 87, 2);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("then open 192.168.4.1", 8, 117, 2);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.drawString("Or: plug into the computer", 8, 155, 2);
  tft.drawString("via USB - no WiFi needed", 8, 178, 2);
  tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  tft.drawString("Firmware v" FW_VERSION, 8, 215, 2);
}

// Non-blocking: with saved credentials this still waits ~10s for the join,
// but a missing/failed WiFi no longer traps boot in the portal - the portal
// keeps running from loop() while the USB serial link can take over the
// screen (wired mode for APs with client isolation).
void setupWiFi() {
  wifiManager.setAPCallback(configModeCallback);
  wifiManager.setConfigPortalBlocking(false);

  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("Connecting WiFi...", 8, 100, 2);

  Serial.println("[wifi] starting WiFiManager autoConnect (non-blocking portal)...");
  bool ok = wifiManager.autoConnect(WIFI_PORTAL_AP_NAME);
  Serial.printf("[wifi] autoConnect result=%d ssid=%s ip=%s\n", ok, WiFi.SSID().c_str(),
                WiFi.localIP().toString().c_str());
  Serial.printf("[wifi] bridge host = '%s'\n", bridgeHost.c_str());
}

bool parseStatusJson(const String &payload) {
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, payload);
  if (err) return false;

  JsonObject c = doc["claude"];
  if (!c.isNull()) {
    claudeStatus.status = c["status"] | "unknown";
    claudeStatus.tokensToday = c["tokens_today"] | 0;
    claudeStatus.sessionMin = c["session_min"] | 0;
    claudeStatus.sessionWindowMin = c["session_window_min"] | 300;
    claudeStatus.fiveHourPct = c["five_hour_pct"] | -1.0;
    claudeStatus.fiveHourResetMin = c["five_hour_reset_min"] | -1;
    claudeStatus.sevenDayPct = c["seven_day_pct"] | -1.0;
    claudeStatus.sevenDayResetMin = c["seven_day_reset_min"] | -1;
    claudeStatus.needsInput = c["needs_input"] | false;
  }

  JsonObject x = doc["codex"];
  if (!x.isNull()) {
    codexStatus.status = x["status"] | "unknown";
    codexStatus.tokensToday = x["tokens_today"] | 0;
    codexStatus.primaryPct = x["primary_pct"] | -1.0;
    codexStatus.primaryResetMin = x["primary_reset_min"] | -1;
    codexStatus.weeklyPct = x["weekly_pct"] | -1.0;
    codexStatus.weeklyResetMin = x["weekly_reset_min"] | -1;
    codexStatus.needsInput = x["needs_input"] | false;
  }
  statusMusicPlaying = doc["music_playing"] | false;
  long epoch = doc["epoch"] | 0L; // bridge wall clock (wired mode has no SNTP)
  if (epoch > 0) setClockFromEpoch(epoch);
  return true;
}

// The mode actually rendered. In AUTO: a pending approval prompt wins (stay on
// the pet so its border can flash red at you), otherwise audio promotes to the
// music page.
DisplayMode effectiveMode() {
  if (displayMode == MODE_AUTO) {
    if (claudeStatus.needsInput || codexStatus.needsInput) return MODE_AUTO;
    // music page needs HTTP for cover/text bitmaps, so don't auto-promote
    // when running wired-only (no WiFi)
    if (statusMusicPlaying && WiFi.status() == WL_CONNECTED) return MODE_MUSIC;
  }
  // MODE_CLOCK with active work: auto-promote to pet page so the user sees
  // Claude/Codex working status. Falls back to clock when idle.
  if (displayMode == MODE_CLOCK) {
    bool claudeWorking = claudeStatus.status == "working";
    bool codexWorking = codexStatus.status == "working";
    if (claudeWorking || codexWorking || claudeStatus.needsInput || codexStatus.needsInput)
      return MODE_AUTO; // pet page: show the working agent
    if (statusMusicPlaying && WiFi.status() == WL_CONNECTED) return MODE_MUSIC;
  }
  return displayMode;
}

