YesIcan-1/esp8266-ai/firmware/src/main.cpp
void pollBridge() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) {
    Serial.printf("[bridge] skip poll: wifi=%d host='%s'\n", WiFi.status() == WL_CONNECTED, bridgeHost.c_str());
    return;
  }

  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + BRIDGE_DEFAULT_PATH;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);

  if (!http.begin(client, url)) {
    Serial.println("[bridge] http.begin() failed");
    return;
  }
  int code = http.GET();
  Serial.printf("[bridge] GET %s -> %d\n", url.c_str(), code);
  if (code == HTTP_CODE_OK) {
    String payload = http.getString();
    if (parseStatusJson(payload)) {
      lastSuccessMs = millis();
      everPolled = true;
      Serial.printf("[bridge] claude=%s tok=%ld | codex=%s tok=%ld primary=%.0f%%\n",
                    claudeStatus.status.c_str(), claudeStatus.tokensToday,
                    codexStatus.status.c_str(), codexStatus.tokensToday, codexStatus.primaryPct);
    } else {
      Serial.println("[bridge] JSON parse failed");
    }
  } else {
    claudeStatus.status = "offline";
    codexStatus.status = "offline";
  }
  http.end();
  DisplayMode eff = effectiveMode();
  if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK && eff != MODE_CLOCK) {
    // Only a real app switch clears the screen; a plain data refresh paints
    // in place so the poll doesn't flash the whole display.
    if (updateActiveApp()) drawActiveApp();
    else refreshActiveApp();
  }
}

// ---------- wired (USB serial) bridge link ----------
// Fallback for WiFi networks with client isolation (device can't reach the
// bridge over LAN) - or for skipping WiFi setup entirely: when the clock is
// plugged into the computer over USB, the bridge pushes the same /status and
// /net payloads down the CH340 serial line as newline-terminated frames:
//   bridge -> device:  #HELLO   #STATUS {json}   #NET {json}   #CMD {json}
//   device -> bridge:  #DEVICE {"name":"aiclock","fw":"x.y.z"}
// Everything else the device prints (logs) is ignored by the bridge.
unsigned long lastSerialFrameMs = 0;
bool wiredEverLinked = false;
char serialLine[1600]; // biggest frame is #STATUS at ~600 bytes
size_t serialLineLen = 0;

bool wiredActive() { return wiredEverLinked && (millis() - lastSerialFrameMs) < 15000UL; }

// ----- wired bulk push: wallpaper + CJK strips + music art over serial -----
// Frames: "#BG <rev> <b64len>", "#STRIP <id> <rev> <b64len>" (0=city 1=hi/lo
// 2=date), "#COVER <rev> <b64len>" or "#MTEXT <rev> <b64len>" header, then
// "#C <base64>" chunk lines (each a multiple of 4 chars), then "#E". Big
// payloads stream into LittleFS staging files and replace the target only
// after the full transfer lands; small strips land in a RAM buffer and are
// blitted when complete. This gives wired-only devices (no WiFi at all) the
// full clock + music pages.
File bgRxFile;
int fileRxType = 0; // 0=none 1=wallpaper 2=music cover 3=music text strip
int bgRxRev = -1;
size_t bgRxBytes = 0;
const char *CLOCKBG_TMP = "/bg.tmp"; // staged until the full transfer lands
int stripRxId = -1; // 0=name 1=hilo 2=date
int stripRxRev = -1;
uint8_t stripRxBuf[DATE_STRIP_W * DATE_STRIP_H * 2]; // largest strip
size_t stripRxBytes = 0;

// Begins a file-target bulk transfer (wallpaper / cover / music text).
void startFileRx(int type, const char *tmpPath, int rev) {
  if (fileRxType) bgRxFile.close();
  stripRxId = -1; // one transfer at a time
  bgRxFile = LittleFS.open(tmpPath, "w");
  fileRxType = bgRxFile ? type : 0;
  bgRxRev = rev;
  bgRxBytes = 0;
}

int b64Val(char c) {
  if (c >= 'A' && c <= 'Z') return c - 'A';
  if (c >= 'a' && c <= 'z') return c - 'a' + 26;
  if (c >= '0' && c <= '9') return c - '0' + 52;
  if (c == '+') return 62;
  if (c == '/') return 63;
  return -1;
}

// Decodes one chunk (length a multiple of 4, '=' padding only at the very
// end of the stream) into out; returns the decoded byte count.
size_t b64Decode(const char *in, size_t n, uint8_t *out) {
  size_t o = 0;
  for (size_t i = 0; i + 4 <= n; i += 4) {
    int v0 = b64Val(in[i]), v1 = b64Val(in[i + 1]);
    int v2 = in[i + 2] == '=' ? -1 : b64Val(in[i + 2]);
    int v3 = in[i + 3] == '=' ? -1 : b64Val(in[i + 3]);
    if (v0 < 0 || v1 < 0) break;
    uint32_t t = ((uint32_t)v0 << 18) | ((uint32_t)v1 << 12) |
                 ((uint32_t)(v2 < 0 ? 0 : v2) << 6) | (uint32_t)(v3 < 0 ? 0 : v3);
    out[o++] = (t >> 16) & 0xFF;
    if (v2 >= 0) out[o++] = (t >> 8) & 0xFF;
    if (v3 >= 0) out[o++] = t & 0xFF;
  }
  return o;
}

void handleBulkChunk(char *b64) {
  size_t n = strlen(b64);
  uint8_t dec[724];
  size_t dn = b64Decode(b64, n, dec);
  if (fileRxType) {
    bgRxFile.write(dec, dn);
    bgRxBytes += dn;
  } else if (stripRxId >= 0) {
    if (stripRxBytes + dn <= sizeof(stripRxBuf)) {
      memcpy(stripRxBuf + stripRxBytes, dec, dn);
      stripRxBytes += dn;
    }
  }
}

// Blits a LittleFS-held RGB565 image (cover art / music text strip); false
// when the file is missing or truncated, so the caller can fall back.
bool blitMusicFile(const char *path, int x, int y, int w, int h) {
  File f = LittleFS.open(path, "r");
  if (!f) return false;
  if ((size_t)f.size() != (size_t)w * h * 2) {
    f.close();
    return false;
  }
  for (int r = 0; r < h; r++) {
    f.read((uint8_t *)rowBuf, (size_t)w * 2);
    tft.pushImage(x, y + r, w, 1, rowBuf);
  }
  f.close();
  return true;
}

void drawMusicScreenWired(); // defined next to drawMusicScreen

void handleBulkEnd() {
  if (fileRxType) {
    int type = fileRxType;
    fileRxType = 0;
    bgRxFile.close();
    const char *tmp = type == 1 ? CLOCKBG_TMP : type == 2 ? COVER_TMP : MTEXT_TMP;
    const char *final = type == 1 ? CLOCKBG_FILE : type == 2 ? COVER_FILE : MTEXT_FILE;
    size_t expect = type == 1 ? CLOCKBG_BYTES : type == 2 ? MUSIC_COVER_BYTES : MUSIC_TEXT_BYTES;
    if (bgRxBytes == expect) {
      LittleFS.remove(final);
      LittleFS.rename(tmp, final);
      if (type == 1) {
        bgDrawnRev = bgRxRev;
        wallpaperReady = true;
        saveWallpaperCfg();
        clockChromeDrawn = false; // full repaint over the new background
        Serial.printf("[wallpaper] serial push ok rev=%d\n", bgRxRev);
      } else if (type == 2) {
        coverFileRev = bgRxRev;
        musicCoverDirty = true;
        Serial.printf("[music] cover push ok rev=%d\n", bgRxRev);
        if (effectiveMode() == MODE_MUSIC) drawMusicScreenWired();
      } else {
        mtextFileRev = bgRxRev;
        musicTextDirty = true;
        Serial.printf("[music] text push ok rev=%d\n", bgRxRev);
        if (effectiveMode() == MODE_MUSIC) drawMusicScreenWired();
      }
    } else {
      LittleFS.remove(tmp); // old file (if any) survives a bad push
      Serial.printf("[bulk] serial push BAD type=%d size %u\n", type, (unsigned)bgRxBytes);
    }
    return;
  }
  if (stripRxId < 0) return;
  int id = stripRxId;
  stripRxId = -1;
  int w = id == 2 ? DATE_STRIP_W : WEATHER_NAME_W;
  int h = id == 2 ? DATE_STRIP_H : WEATHER_NAME_H;
  int x = id == 0 ? CITY_STRIP_X : id == 1 ? HILO_STRIP_X : DATE_STRIP_X;
  int y = id == 0 ? CITY_STRIP_Y : id == 1 ? HILO_STRIP_Y : DATE_STRIP_Y;
  if (stripRxBytes != (size_t)w * h * 2) {
    Serial.printf("[strip] serial push BAD id=%d size %u\n", id, (unsigned)stripRxBytes);
    return;
  }
  if (id == 0) weatherNameDrawnRev = stripRxRev;
  else if (id == 1) weatherHiloDrawnRev = stripRxRev;
  else dateDrawnRev = stripRxRev;
  // Draw now only when the clock page is up without the wallpaper (with the
  // wallpaper on, these lines are baked into it; the drawn-rev bump above
  // still stops the HTTP fallback from re-fetching).
  if (effectiveMode() == MODE_CLOCK && !(wallpaperOn && wallpaperReady)) {
    for (int r = 0; r < h; r++) {
      memcpy(rowBuf, stripRxBuf + (size_t)r * w * 2, (size_t)w * 2);
      tft.pushImage(x, y + r, w, 1, rowBuf);
    }
  }
}

// First data over either transport replaces the boot/portal screen.
void showMainUiIfNeeded() {
  if (mainUiShown) return;
  mainUiShown = true;
  drawStaticChrome();
  updateActiveApp();
  drawActiveApp();
}

void handleSerialFrame(char *line) {
  lastSerialFrameMs = millis();
  wiredEverLinked = true;
  if (!strncmp(line, "#HELLO", 6)) {
    Serial.printf("#DEVICE {\"name\":\"aiclock\",\"fw\":\"%s\"}\n", FW_VERSION);
    return;
  }
  if (!strncmp(line, "#STATUS ", 8)) {
    if (parseStatusJson(String(line + 8))) {
      lastSuccessMs = millis();
      everPolled = true;
      showMainUiIfNeeded();
      DisplayMode eff = effectiveMode();
      if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK && eff != MODE_CLOCK) {
        if (updateActiveApp()) drawActiveApp();
        else refreshActiveApp();
      }
    }
    return;
  }
  if (!strncmp(line, "#NET ", 5)) {
    handleNetPayload(String(line + 5));
    return;
  }
  if (!strncmp(line, "#STOCK ", 7)) {
    handleStockPayload(String(line + 7));
    return;
  }
  if (!strncmp(line, "#WEATHER ", 9)) {
    // Wired mode owns the data path: weather arrives over serial instead of
    // HTTP. The CJK strips + wallpaper follow as #STRIP/#BG bulk pushes.
    if (handleWeatherPayload(String(line + 9))) {
      Serial.printf("[weather] serial ok=%d temp=%.1f code=%d hum=%d\n", weatherEverLoaded,
                    weatherTempC, weatherCode, weatherHumidity);
    }
    return;
  }
  if (!strncmp(line, "#BG ", 4)) {
    int rev;
    long len;
    if (sscanf(line + 4, "%d %ld", &rev, &len) == 2 && len > 0)
      startFileRx(1, CLOCKBG_TMP, rev);
    return;
  }
  if (!strncmp(line, "#COVER ", 7)) {
    int rev;
    long len;
    if (sscanf(line + 7, "%d %ld", &rev, &len) == 2 && len > 0)
      startFileRx(2, COVER_TMP, rev);
    return;
  }
  if (!strncmp(line, "#MTEXT ", 7)) {
    int rev;
    long len;
    if (sscanf(line + 7, "%d %ld", &rev, &len) == 2 && len > 0)
      startFileRx(3, MTEXT_TMP, rev);
    return;
  }
  if (!strncmp(line, "#STRIP ", 7)) {
    int id, rev;
    long len;
    if (sscanf(line + 7, "%d %d %ld", &id, &rev, &len) == 3 && id >= 0 && id <= 2 && len > 0 &&
        !fileRxType) {
      stripRxId = id;
      stripRxRev = rev;
      stripRxBytes = 0;
    }
    return;
  }
  if (!strncmp(line, "#MUSIC ", 7)) {
    bool cc = false, tc = false;
    if (applyMusicJson(String(line + 7), &cc, &tc)) {
      musicCoverDirty |= cc;
      musicTextDirty |= tc;
      if (effectiveMode() == MODE_MUSIC) drawMusicScreenWired();
    }
    return;
  }
  if (!strncmp(line, "#C ", 3)) {
    handleBulkChunk(line + 3);
    return;
  }
  if (!strcmp(line, "#E")) {
    handleBulkEnd();
    return;
  }
  if (!strncmp(line, "#DEEPSEEK ", 10)) {
    if (handleDeepSeekPayload(String(line + 10))) {
      Serial.printf("[deepseek] serial ok=%d bal=%.2f %s avail=%d\n", dsEverLoaded, dsBalance,
                    dsCurrency, dsAvailable);
    }
    return;
  }
  if (!strncmp(line, "#CMD ", 5)) {
    JsonDocument doc;
    if (deserializeJson(doc, line + 5)) return;
    if (doc["brightness"].is<int>()) {
      brightness = constrain(doc["brightness"].as<int>(), 0, 100);
      applyBrightness();
      saveBrightness();
    }
    const char *mode = doc["display"] | (const char *)nullptr;
    if (mode) {
      String m(mode);
      if (m == "auto") displayMode = MODE_AUTO;
      else if (m == "claude") displayMode = MODE_CLAUDE;
      else if (m == "codex") displayMode = MODE_CODEX;
      else if (m == "net") displayMode = MODE_NET;
      else if (m == "music") displayMode = MODE_MUSIC;
      else if (m == "stock") displayMode = MODE_STOCK;
      else if (m == "clock") displayMode = MODE_CLOCK;
      // the effectiveMode transition handler in loop() repaints the chrome
    }
    return;
  }
}

